'''
企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；利润高于10万元，低于20万元时，
低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；20万到40万之间时，
高于20万元的部分，可提成5%；40万到60万之间时高于40万元的部分，可提成3%；60万到100万之间时，
高于60万元的部分，可提成1.5%，高于100万元时，超过100万元的部分按1%提成，从键盘输入当月利润I，求应发放奖金总数？
'''


def Count(num):

    T_num=0
    
    if num<= 10:
        T_num=num*0.1
    elif num>10 and num<=20:
        T_num=10*0.1+(num-10)*0.075
    elif num>20 and num<=40:
        T_num=10*0.1+10*0.075+(num-20)*0.05
    elif num>40 and num<=60:
        T_num=10*0.1+10*0.075+20*0.05+(num-40)*0.03
    elif num>60 and num<=100:
        T_num=10*0.1+10*0.075+20*0.05+20*0.03+(num-60)*0.015
    elif num>100:
        T_num=10*0.1+10*0.075+20*0.05+20*0.03+40*0.015+(num-100)*0.01
    return T_num



def run():
    num=float(input('请输入你的营业额：(万元)'));
    print('你的奖励是%f万元'% Count(num));

run()
        
        
            
